doc/DMIR图像检索服务器使用说明.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DMIR图像检索服务器使用说明</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="DMIR图像检索服务器使用说明"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-23T15:58+0800"/>
<meta name="author" content="Hsu Chifeng"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">DMIR图像检索服务器使用说明</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 DMIR图像检索服务器使用说明</a>
<ul>
<li><a href="#sec-1-1">1.1 登录服务器</a></li>
<li><a href="#sec-1-2">1.2 目录说明</a></li>
<li><a href="#sec-1-3">1.3 配置文件</a></li>
<li><a href="#sec-1-4">1.4 使用</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> DMIR图像检索服务器使用说明</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 登录服务器</h3>
<div class="outline-text-3" id="text-1-1">

<p>   内网ssh登录，windows平台下可以使用putty.
</p><ul>
<li>服务器IP: 10.21.23.125
</li>
<li>用户名: imret
</li>
<li>密码:  imret
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 目录说明</h3>
<div class="outline-text-3" id="text-1-2">

<p>   项目的文件均位于/home/imret/imret目录下,其中
</p><ul>
<li>DataSet/ 文件夹存放数据集文件,包括PI100 和 256<sub>ObjectCategories两个数据集。其中</sub>

<p>
     PI100含有图像9 917张,每张图像的分辨率均为100*100。256<sub>ObjectCategories含有图像</sub>
</p>
<p>
     30 598张,图像有大有小。
</p></li>
<li>imgInfo/ 文件夹包含用于读取图像信息的两个shell脚本,以及指向 DataSet 特定图像的软

<p>
     链接,建议把实验结果存放与此文件夹。
</p></li>
<li>bin/ 包含用于提取SIFT特征，聚类，图像检索服务器/客户端。这些命令都可以不带参数调用

<p>
     以查看使用方法
</p></li>
<li>src/ 实现源文件
</li>
<li>include/ 实现头文件
</li>
<li>mist/ 数据库表文件及Google protobuf 定义文件
</li>
<li>conf/ 某些程序运行时由于需要的参数比较多，所以统一从配置文件读取这些参数，建议配置文件

<p>
     都放在这个目录下。
</p></li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 配置文件</h3>
<div class="outline-text-3" id="text-1-3">

<p>   配置文件的每行均为key="value" 形式,以 # 开头的为注释
   支持的key如下:
</p><ul>
<li>PGURI,连接数据库的URI,egg:postgresql://username:password@server-address/database
</li>
<li>image,用于选择初始化的图像集，imageClass为给图像的标签,改语句实际为SQL语句中的where子句，

<p>
    所以可以加入其它符合SQL语法的命令。这个值确定好后不要修改，不然会无法读取已经写入的数据！
</p></li>
<li>k ,k-means聚类时使用的k
</li>
<li>precision, k-means收敛的精度
</li>
<li>maxCount, k-means的最大迭代次数
</li>
<li>nresult, 图像检索服务器返回的最大结果数
</li>
<li>resultSimilarity, 图像检索服务器返回结果的最小相似度[0,1]
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 使用</h3>
<div class="outline-text-3" id="text-1-4">

<ol>
<li>确定图像集



<pre class="src src-sh"><span style="color: #73d216;">#</span><span style="color: #73d216;">&#20551;&#35774;&#24050;&#32463;&#36827;&#20837;&#24037;&#31243;&#30446;&#24405;imret&#19979;,&#19979;&#38754;&#30340;&#23558;&#20174;256_Obj..&#36873;&#21313;&#20010;&#30446;&#24405;&#20316;&#20026;&#22270;&#20687;&#38598;</span>
$ cd imgInfo/img
<span style="color: #73d216;">#</span><span style="color: #73d216;">&#23558;&#22270;&#20687;&#38598;&#25918;&#22312; 10Dir&#30446;&#24405;</span>
$ mkdir 10Dir
$ cd 10Dir
<span style="color: #73d216;"># </span><span style="color: #73d216;">&#24314;&#31435;DataSet/ &#20013;&#21313;&#20010;&#30446;&#24405;&#21040;&#27492;&#30340;&#36719;&#38142;&#25509;</span>
$ ln -s ~/imret/DataSet/ImageFiles/256_ObjectCategories/001.ak47/ 1
$ ln -s ~/imret/DataSet/ImageFiles/256_ObjectCategories/002.american-flag/ 2
<span style="color: #73d216;"># </span><span style="color: #73d216;">...&#37325;&#22797;&#20197;&#19978;&#21629;&#20196;&#30452;&#21040;&#24314;&#31435;&#23436;&#25152;&#26377;&#30340;&#36719;&#38142;&#25509;</span>
</pre>


</li>
<li>生成图像集信息并写入数据库



<pre class="src src-sh"><span style="color: #73d216;">#</span><span style="color: #73d216;">&#29983;&#25104;&#30001;&#27493;&#39588;1)&#30830;&#23450;&#30340;&#22270;&#20687;&#38598;&#20449;&#24687;</span>
$ cd imgInfo
<span style="color: #73d216;">#</span><span style="color: #73d216;">&#31532;&#19968;&#20010;&#21442;&#25968;&#20026;&#27493;&#39588;1)&#30340;&#22270;&#20687;&#38598;&#30446;&#24405;, &#31532;&#20108;&#20010;&#21442;&#25968;&#20026;&#32473;&#35813;&#22270;&#20687;&#38598;&#35774;&#32622;&#30340;&#26631;&#31614;,&#32467;&#26524;&#20250;&#36755;&#20986;&#21040;&#26631;&#20934;&#36755;&#20986;&#65292;</span>
 &#20351;&#29992;&#37325;&#23450;&#21521;&#23558;&#32467;&#26524;&#20889;&#21040;&#25991;&#20214;,&#20197;&#19979;&#21629;&#20196;&#23558;&#22270;&#20687;&#38598;10Dir&#25171;&#19978;10Dir&#30340;&#26631;&#31614;&#24182;&#25226;&#32467;&#26524;&#20889;&#21040;&#25991;&#20214;10Dir.csv
$ ./readImgInfo.sh img/10Dir 10Dir &gt; 10Dir.csv
<span style="color: #73d216;">#</span><span style="color: #73d216;">&#23558;&#22270;&#20687;&#38598;&#25968;&#25454;&#20889;&#20837;&#25968;&#25454;&#24211;,&#25152;&#38656;&#21442;&#25968;&#20026;&#19978;&#36848;&#21629;&#20196;&#29983;&#25104;&#30340;CSV&#25991;&#20214;</span>
$ ./writeImgInfoDB.sh 10Dir.csv
</pre>

<p>
     完成上述步骤之后最后还要修改配置文件，以让其它的操作能够正确读取图像集
</p>
<p>
     可以直接复制已存在的配置文件PI100.conf,并修改其中的image值，将imageClass修改为在
</p>


<pre class="src src-sh">$ ./readImgInfo.sh img/10Dir 10Dir &gt; 10Dir.csv
</pre>

<p>
     命令中使用的标签
</p></li>
<li>提取图像集的SIFT特征
     以下命令针对步骤2)的图像集



<pre class="src src-sh">$ cd bin
<span style="color: #73d216;">#</span><span style="color: #73d216;">./calcSift &#21629;&#20196;&#29992;&#20110;&#35745;&#31639;&#22270;&#20687;&#38598;&#30340;SIFT&#29305;&#24449;&#65292;&#24182;&#25226;&#32467;&#26524;&#20197;CSV&#26684;&#24335;&#36755;&#20986;&#21040;&#26631;&#20934;&#36755;&#20986;&#65292;</span>
<span style="color: #73d216;">#</span><span style="color: #73d216;">&#36816;&#34892;&#26102;&#30340;&#31243;&#24207;&#29366;&#24577;&#20250;&#36755;&#20986;&#21040;&#26631;&#20934;&#38169;&#35823;&#12290;&#20351;&#29992;&#37325;&#23450;&#21521;&#26631;&#20934;&#36755;&#20986;&#23558;&#32467;&#26524;&#20889;&#20837;&#25991;&#20214;&#12290;</span>
<span style="color: #73d216;">#</span><span style="color: #73d216;">&#20026;&#20102;&#26041;&#20415;&#25340;&#25509;&#19981;&#21516;&#25968;&#25454;&#38598;&#65292;CSV&#36755;&#20986;&#27809;&#26377;&#21253;&#21547;&#22836;&#65292;&#38656;&#35201;&#25163;&#24037;&#20026;&#32467;&#26524;&#25991;&#20214;&#20889;&#20837;CSV&#22836;</span>
$ echo <span style="color: #e9b96e;">"imageID,position,feature"</span> &gt; ../imgInfo/10DirSIFT.csv
$ ./calcSift ../conf/10Dir.conf   &gt;&gt;  ../imgInfo/10DirSIFT.csv
</pre>

</li>
<li>聚类并生成视觉词汇{频率|计数}直方图

<p>
     聚类中的相应参数由配置文件提供,对图像集很大数据进行下面的操作会花费很长的时间。
</p>
<p>
     这种情况下可以使用 nohup 命令，使得退出了远程登录后命令仍在运行。
</p>


<pre class="src src-sh"><span style="color: #73d216;">#</span><span style="color: #73d216;">&#31532;&#19968;&#20010;&#21442;&#25968;&#20026;&#37197;&#32622;&#25991;&#20214;&#36335;&#24452;&#65292;&#31532;&#20108;&#20010;&#21442;&#25968;&#20026;&#27493;&#39588;3)&#29983;&#25104;&#30340;CSV&#25991;&#20214;</span>
$ ./featsKmeans ../conf/10Dir.conf ../imgInfo/10DirSIFT.csv
<span style="color: #73d216;">#</span><span style="color: #73d216;">&#20351;&#29992;nohup&#30340;&#31034;&#20363;</span>
$<span style="color: #fcaf3e;">nophup</span>  ./featsKmeans ../conf/10Dir.conf ../imgInfo/10DirSIFT.csv &amp;
</pre>

</li>
<li>提取视觉词汇计数直方图到CSV文件
     完成了步骤4)之后就可以提取实验数据了。

<p>
     下面的命令将生成视觉词汇计数的直方图到文件10DirCount.csv，
</p>
<p>
     该文件的头为imagepath,image<sub>visual</sub><sub>word</sub>
</p>


<pre class="src src-sh">$ ./genData ../conf/10Dir.conf &gt; ../imgInfo/10DirCount.csv
</pre>

</li>
</ol>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-05-23T15:58+0800</p>
<p class="author">Author: Hsu Chifeng</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
